tech-interview-backend-entry-level-main/app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "carts" ("total_price", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["total_price", "0.0"], ["created_at", "2025-02-06 19:33:44.971176"], ["updated_at", "2025-02-06 19:33:44.971176"]]
---
  def find_or_create_cart
    cart_id = session[:cart_id] || cookies[:cart_id] # Busca pelo ID na sessão ou cookie

    if cart_id
      cart = Cart.find_by(id: cart_id)
      return cart if cart.present?
    end

    # Se não existir, cria um novo carrinho e salva na sessão e cookie
    cart = Cart.create!(total_price: 0.0)