tech-interview-backend-entry-level-main/app/controllers/carts_controller.rb

  def create
    product_id = params[:product_id]
    quantity = params[:quantity].to_i

    unless product_id
      return render json: { error: "Parâmetro product_id é obrigatório" }, status: :bad_request
    end

    @cart = find_or_create_cart
    product = Product.find_by(id: product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_or_create_cart
    cart = Cart.find_by(id: session[:cart_id])
    return cart if cart.present?

    cart = Cart.new(total_price: 0.0)
    cart.save! # Garante que o ID seja gerado corretamente
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "carts" SET "total_price" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["total_price", "77999.94"], ["updated_at", "2025-02-06 23:32:35.282823"], ["id", 7]]
INSERT INTO "carts" ("total_price", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["total_price", "0.0"], ["created_at", "2025-02-06 22:26:56.959760"], ["updated_at", "2025-02-06 22:26:56.959760"]]

  def add_product_to_cart(cart, product, quantity)
    item = CartItem.find_or_initialize_by(cart: cart, product: product)
    item.quantity += (item.quantity || 0) + quantity
    if item.save!
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", 7], ["product_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = $1, "quantity" = $2 WHERE "cart_items"."id" = $3  [["updated_at", "2025-02-06 23:23:35.469474"], ["quantity", 4], ["id", 2]]

  def update_cart_total(cart)
    total = cart.cart_items.sum { |item| item.quantity * item.product.price }
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 7]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def cart_response(cart)
    {
      id: cart.id,
      products: cart.cart_items.map do |item|
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 7]]