tech-interview-backend-entry-level-main/app/models/cart.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_total_price
    total = cart_items.sum { |item| item.quantity * item.product.price }